Revit 2017 API
RebarCoupler.GetCoupledReinforcementData Method
 gets the reinforcement data. If coupler stays on one bar the list will have size = 1. If coupler connects two bars the size will be 2.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public IList<ReinforcementData> GetCoupledReinforcementData()
Visual Basic
Public Function GetCoupledReinforcementData As IList(Of ReinforcementData)
Visual C++
public:
IList<ReinforcementData^>^ GetCoupledReinforcementData()
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace